iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval.c
  switch (JoyPins)
  {
  case JOY_SEL:
    io_init_structure.Pin = JOY_SEL_PIN[JOY];
    break;
  case JOY_DOWN:
    io_init_structure.Pin = JOY_DOWN_PIN[JOY];
    break;
  case JOY_LEFT:
    io_init_structure.Pin = JOY_LEFT_PIN[JOY];
    break;
  case JOY_RIGHT:
    io_init_structure.Pin = JOY_RIGHT_PIN[JOY];
    break;
  case JOY_UP:
    io_init_structure.Pin = JOY_UP_PIN[JOY];
    break;
  case JOY_ALL:
    io_init_structure.Pin = JOY_ALL_PIN[JOY];
    break;
  default :
    break;
  }

  io_init_structure.Pull = IO_PULLUP;
  io_init_structure.Mode =IO_MODE_OFF;

  if(BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }

  JoyPinsMask &= ~io_init_structure.Pin;
#endif

  return ret;
}

/**
  * @brief  Returns the current joystick status.
  * @param  JOY Joystick instance
  * @retval Code of the joystick key pressed
  *          This code can be one of the following values:
  *            @arg  JOY1_NONE
  *            @arg  JOY1_SEL
  *            @arg  JOY1_DOWN
  *            @arg  JOY1_LEFT
  *            @arg  JOY1_RIGHT
  *            @arg  JOY1_UP
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  uint32_t pin_status;

  /* Read the status joystick pins   */
#if (USE_BSP_IO_CLASS > 0)
  pin_status = (uint32_t)BSP_IO_ReadPin(0, (uint32_t)(JOY_ALL_PIN[JOY] & JoyPinsMask));
#endif

  if((int32_t)pin_status != BSP_ERROR_WRONG_PARAM)
  {
    /* Check the pressed keys   */
    if((pin_status | JOY_SEL_PIN[JOY]) == JoyPinsMask)
    {
      return (int32_t)JOY_SEL;
    }
    else if((pin_status | JOY_DOWN_PIN[JOY]) == JoyPinsMask)
    {
      return (int32_t)JOY_DOWN;
    }
    else if((pin_status | JOY_LEFT_PIN[JOY]) == JoyPinsMask)
    {
      return (int32_t)JOY_LEFT;
    }
    else if((pin_status | JOY_RIGHT_PIN[JOY]) == JoyPinsMask)
    {
      return (int32_t)JOY_RIGHT;
    }
    else if((pin_status | JOY_UP_PIN[JOY]) == JoyPinsMask)
    {
      return (int32_t)JOY_UP;
    }
    else
    {
      return (int32_t)JOY_NONE;
    }
  }
  else
  {
    return (int32_t)pin_status;
  }
}

/**
  * @brief  BSP JOY interrupt handler.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @param  JoyPin Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  * @retval None.
  */
void BSP_JOY_IRQHandler(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JoyPin);

  HAL_EXTI_IRQHandler(&hjoy_exti[JOY]);
}

/**
  * @brief  BSP Joystick Callback.
  * @param  JOY Joystick to be de-init.
  *   This parameter can be JOY1
  * @param  JoyPin Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  * @retval None.
  */
__weak void BSP_JOY_Callback(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JOY);
  UNUSED(JoyPin);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}
#endif /* USE_BSP_JOY_FEATURE   */
/**
  * @}
  */

/** @defgroup STM32H743I_EVAL_LOW_LEVEL_Private_Functions LOW LEVEL Private Functions
  * @{
  */
/**
  * @brief  WAKEUP EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_WAKEUP_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_WAKEUP);
}

/**
  * @brief  TAMPER EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_TAMPER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_TAMPER);
}

/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER);
}

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Initializes UART MSP.
  * @param  huart UART handle
  * @retval None
  */
static void USART1_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  /* Enable GPIO clock */
  COM1_TX_GPIO_CLK_ENABLE();
  COM1_RX_GPIO_CLK_ENABLE();

  /* Enable USART clock */
  COM1_CLK_ENABLE();

  /* Configure USART Tx as alternate function */
  gpio_init_structure.Pin = COM1_TX_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Alternate = COM1_TX_AF;
  HAL_GPIO_Init(COM1_TX_GPIO_PORT, &gpio_init_structure);

  /* Configure USART Rx as alternate function */
  gpio_init_structure.Pin = COM1_RX_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = COM1_RX_AF;
  HAL_GPIO_Init(COM1_RX_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief  Initialize USART1 Msp part
  * @param  huart UART handle
  * @retval None
  */
static void USART1_MspDeInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef          gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  /* COM GPIO pin configuration */
  gpio_init_structure.Pin  = COM1_TX_PIN;
  HAL_GPIO_DeInit(COM1_TX_GPIO_PORT, gpio_init_structure.Pin);

  gpio_init_structure.Pin  = COM1_RX_PIN;
  HAL_GPIO_DeInit(COM1_RX_GPIO_PORT, gpio_init_structure.Pin);

  /* Disable USART clock */
  COM1_CLK_DISABLE();
}
#endif /* USE_BSP_COM_FEATURE   */

#if (USE_BSP_POT_FEATURE > 0)
/**
  * @brief  Initialize POT1 Msp part
  * @param  hadc ADC handle
  * @retval None
  */
static void ADC1_MspInit(ADC_HandleTypeDef *hadc)
{
  GPIO_InitTypeDef          gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  POT1_CLK_ENABLE();
  POT1_CHANNEL_GPIO_CLK_ENABLE();

  /* ADC Channel GPIO pin configuration */
  gpio_init_structure.Pin  = POT1_CHANNEL_GPIO_PIN;
  gpio_init_structure.Mode = GPIO_MODE_ANALOG;
  gpio_init_structure.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(POT1_CHANNEL_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief  De-Initialize POT1 Msp part
  * @param  hadc ADC handle
  * @retval None
  */
static void ADC1_MspDeInit(ADC_HandleTypeDef *hadc)
{
  GPIO_InitTypeDef          gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  /* POT GPIO pin configuration */
  gpio_init_structure.Pin  = POT1_CHANNEL_GPIO_PIN;
  HAL_GPIO_DeInit(POT1_CHANNEL_GPIO_PORT, gpio_init_structure.Pin);

  /* Disable ADC clock */
  POT1_CLK_DISABLE();
}
#endif /* USE_BSP_POT_FEATURE   */

#if (USE_BSP_JOY_FEATURE > 0)

/**
  * @brief  Joystick EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_EXTI_Callback(void)
{
  uint32_t it_status;
  JOYPin_TypeDef JoyPin = JOY_NONE;
#if (USE_BSP_IO_CLASS > 0)
  it_status = (uint32_t)BSP_IO_GetIT(0, JOY_ALL);
#endif
  switch(it_status)
  {
  case JOY_SEL:
    JoyPin = JOY_SEL;
    break;
  case JOY_DOWN:
    JoyPin = JOY_DOWN;
    break;
  case JOY_LEFT:
    JoyPin = JOY_LEFT;
    break;
  case JOY_RIGHT:
    JoyPin = JOY_RIGHT;
    break;
  case JOY_UP:
    JoyPin = JOY_UP;
    break;
  default:
    break;
  }

  BSP_JOY_Callback(JOY1, JoyPin);
#if (USE_BSP_IO_CLASS > 0)
  (void)BSP_IO_ClearIT(0, it_status);
#endif
}
#endif /* USE_BSP_JOY_FEATURE   */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
